request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost/universities">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUniversityRequest>
            <gs:name>Strathmore</gs:name>
        </gs:getUniversityRequest>
    </soapenv:Body>
</soapenv:Envelope>
